{
    "personal" : 
    {
        "firstname": "Michael",
        "lastname": "Bruyninckx",
        "residence": "Groene Laan 5, Willebroek, Belgium",
        "nationality": "Belgian",
        "email": "michael@modul8.com",
        "phone": "+32 486 89 77 42",
        "birthdate": "JUNE 20th, 1975",
        "place_of_birth": "Euskirchen, Duitsland",
        "family_state": "Divorced",
        "children": "1 daughter",
        "experienced": "24 years, since October 5th 1995",
        "languages": [
            { "language": "Nederlands", "skill_level": "moedertaal" },
            { "language": "Francais", "skill_level": "ex-marie était une Francophone d’Anderlecht" },
            { "language": "English", "skill_level": "very well, I work in software development, often used as neutral language in BE" },
            { "language": "Deutsch", "skill_level": "Sprache der Mutter – geboren und gewohnt in der Nähe von Euskirchen" }
        ],
        "availabile": "April 1st 2020",
        "picture": "",
        "recognitions": "",
        "profile_summary": [
            "Michael has 24 years of experience in development, analysis, small team and project management of thin- (HTML, JavaScript, ASP, ASP.net (core), CSS) and fat-client (WPF, WinForms) applications using Microsoft development tools.",
            "His background as website and web application developer makes him an excellent alround application developer.  While he was a business owner, of the companies Fusebox (2004-2010) and more recently Cherimoya.be (2017-2018), he was a good business analyst, technical project manager, team leader and dot net developer.",
            "Throughout his career he has obtained good inter-personal and communication skills, coupled with a strong desire to achieve the requirements and goals of the projects or company objectives he has worked within.",
            "During his co-ownership of Fusebox – a small software development company that mainly built custom web applications – he was well known for his professionalism towards customers and team members.  He successfully rolled out projects (mostly in time and budget) which lead to great customer satisfaction.  He was also responsible for a development team of 8 developers.",
            "During his more recent co-ownership of Cherimoya.be – a small software development company that focusses on the Travel Industry – he developed a worldwide unique application that enlarges the margins gained on flight tickets… a real money cow for our customers as well as Cherimoya.be.",
            "In his spare time he loves to research new things in dot net and JavaScript world."
        ],
        "professional_skills_interests": [
            "Follows the newest developments on Javascript (Angular, Aurelia, React, Typescript) and .NET (XAML, WCF, WPF, WebAPI, MVC, MVVM, Entity Framework, etc)",
            "Believes that new technology will make developers happier, which will result in better user experiences",
            "Technical project management and coaching team members",
            "Strong thin and fat client application development skills",
            "Has a lot of patience",
            "Believes that open communication and honesty are crucial to success"
        ],
        "relevant_education": [
            { "year": 1999, "school": "Cobraz", "city": "Hoboken", "degree": "Bachelor Toegepaste Informatica", "note": "graduated with distinction" },
            { "year": 1993, "school": "Stedelijk instituut voor secundair onderwijs", "city": "Berchem", "degree": "TSO Boekhouden – Informatica", "note": "qualification exams: Typewriting & Accountancy + Price for Best German student of the province of Antwerp" }
        ],
        "other_education": [
            "Pluralsight subscriber since 2011",
            "Travel Tech – London 2016",
            "MIC Brussels: Call for Windows 8 Metro Style Apps: UX Session (May 14 2012)",
            "MIC Brussels: Call for Windows 8 Metro Style Apps: Hands on Sessions (April 16 & 17 2012)",
            "Microsoft Windows 8 Developer Day & Night – (March 23 2012)",
            "Microsoft Belgium: Tech Days 2010",
            "Microsoft Belgium: Tech Days 2005",
            "U2U: 21 days training for MCSD.NET certification – never did the certification exams",
            "Microsoft Belgium: 2 days training on ASP.NET",
            "Microsoft Belgium: 5 days: Masterclass building .NET applications using Visual Studio .NET"
        ]
    }
}