{
    "clients": [
        {
            "end_customer": "AG Insurance",
            "location": "Brussels",
            "started": "2018-03-10",
            "ended": "2020-03-31",
            "function": ".Net and Angular technical lead developer",
            "via": "3D ICT",
            "note": "",
            "projects":
            [
                {
                    "name": "Event Registration",
                    "description": "subscribtion/reservation application for events organized by AG Insurance, the web application allowed the user to reserve a 'time slot' for a car body repair event.",
                    "technologies": [ "ASP.NET MVC", "MS Test", "Unity" ]
                },
                {
                    "name": "AG Webtemplate",
                    "description": "a redo in Angular of the existing ASP.NET MVC Webtemplate, bringing over all flexibility and configuration features existing in the MVC version.",
                    "technologies": [ "Angular", "Typescript" ]
                },
                {
                    "name": "Customer 360",
                    "description": "intranet web application to answer the question 'which customer has what insurance products and/or claims at AG Insurance ?'.  This application had a big visibility to the upper management, above that it was the first 'agile' project at AG Insurance, it was a big success.",
                    "technologies": [ "Angular", "Typescript", "Unit Tests", "JSON", "Scrum" ]
                },
                {
                    "name": "IIS10 Migration tool",
                    "description": "small CLI tool to update the web.configs and *.cs files so that existing applications could migrate to new servers.",
                    "technologies": [ "C#", "Akka.net" ]
                }
                {
                    "name": "AG Online Bonus Modulis",
                    "description": "new 'flow' (= part) in the AG Online application that end customers use to check up on a bonus, and to choose where they wanted their bonus to be paid.",
                    "technologies": [ "ASP.NET MVC", "MS Test", "Unity" ]
                },
                {
                    "name": "EMC Claims 2.0",
                    "description": "web application that allows brokers to to file a claim of a car accident",
                    "technologies": [ "ASP.NET MVC", "MS Test", "Unity" ]
                }
            ]
        },
        {
            "end_customer": "Baloise",
            "location": "Berchem, Antwerpen",
            "started": "2018-02-01",
            "ended": "2018-02-28",
            "function": ".Net developer",
            "via": "3D ICT",
            "note": "Left the company/assignment early, because all 3 'big' projects where I should work on were postponed for several months, and because of that I felt I was wasting their budget.",
            "projects":
            [
                {
                    "name": "Intake Web Quoter",
                    "description": "We needed to 'take in' a web project – which was developed by a third party.  I had to reorganize things, and prepare everything so it could be auto deployed.",
                    "technologies": [ "ASP.NET MVC", "Azure Dev Ops" ]
                },
                {
                    "name": "Document Manager",
                    "description": "Created a proof of concept that you could host a Web API and an OData API and a WCF Service all in the same project.",
                    "technologies": [ "ASP.NET Web API", "C#" ]
                }
            ]
        },
        {
            "end_customer": "Econocom",
            "location": "Zaventem",
            "started": "2018-01-22",
            "ended": "2018-01-31",
            "function": ".Net developer",
            "via": "Econocom",
            "note": "A friend who works at Econocom needed a hand on a project, I helped him during 10 days, where I could successfully produce a parser for the ABB Rapid language, unfortunatly I had to start at another project which I already had signed.",
            "projects":
            [
                {
                    "name": "ABB Visual IDE – Proof of Concept",
                    "description": "The Visual IDE should dumb down the ABB Rapid language so that regular robot controller personnel could update the 'program'.  I created the parser for the ABB Rapid language using Antlr, this resulted in a json array so that the UI guys could generate the correct UI objects.",
                    "technologies": [ "C#", "Azure Dev Ops", "Antlr" ]
                }
            ]
        }
    ]    
}